Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The check fails on differing translations of one string within a project. This can also lead to inconsistencies in displayed checks. You can find other translations of this string on the :guilabel:`Other occurrences` tab.
sv: Kontrollen misslyckas pÃ¥ grund av olika Ã¶versÃ¤ttningar av en strÃ¤ng inom ett projekt. Detta kan ocksÃ¥ leda till inkonsekvenser i de kontroller som visas. Du kan hitta andra Ã¶versÃ¤ttningar av denna strÃ¤ng pÃ¥ fliken :guilabel:`Andra fÃ¶rekomster`.

source: This check applies to all components in a project that have :ref:`component-allow_translation_propagation` turned on.
sv: Denna kontroll gÃ¤ller alla komponenter i ett projekt som har :ref:`component-allow_translation_propagation` aktiverat.

source: For performance reasons, the check might not find all inconsistencies, it limits number of matches.
sv: Av prestandaskÃ¤l kan det hÃ¤nda att kontrollen inte hittar alla inkonsekvenser, eftersom den begrÃ¤nsar antalet trÃ¤ffar.

source: This check also fires in case the string is translated in one component and not in another. It can be used as a quick way to manually handle strings which are untranslated in some components just by clicking on the :guilabel:`Use this translation` button displayed on each line in the :guilabel:`Other occurrences` tab.
sv: Denna kontroll utlÃ¶ses Ã¤ven om strÃ¤ngen Ã¤r Ã¶versatt i en komponent men inte i en annan. Den kan anvÃ¤ndas som ett snabbt sÃ¤tt att manuellt hantera strÃ¤ngar som inte Ã¤r Ã¶versatta i vissa komponenter genom att klicka pÃ¥ knappen :guilabel:`AnvÃ¤nd denna Ã¶versÃ¤ttning` som visas pÃ¥ varje rad i fliken :guilabel:`Andra fÃ¶rekomster`.

source: You can use :ref:`addon-weblate.autotranslate.autotranslate` add-on to automate translating of newly added strings which are already translated in another component.
sv: Du kan anvÃ¤nda tillÃ¤gget :ref:`addon-weblate.autotranslate.autotranslate` fÃ¶r att automatisera Ã¶versÃ¤ttningen av nyinlagda strÃ¤ngar som redan Ã¤r Ã¶versatta i en annan komponent.

source: reStructuredText term references or other markup do not match source, the typical causes for these errors are:
sv: reStructuredText-termreferenser eller andra markeringar stÃ¤mmer inte Ã¶verens med kÃ¤llan. De vanligaste orsakerna till dessa fel Ã¤r:

source: Mismatched or missing backticks.
sv: Felaktiga eller saknade bakstreck.

source: Missing spaces or interpunction around the reference. The reStructuredText inline blocks need to be separated by non-word characters.
sv: Saknade mellanslag eller skiljetecken runt referensen. Inline-blocken i reStructuredText mÃ¥ste separeras med icke-ordtecken.

source: Space between inline tag and backticks.
sv: Mellanslag mellan inline-taggen och backticks.

source: The reference name is not being translated.
sv: Referensnamnet Ã¶versÃ¤tts inte.

source: Using quotes instead of backticks.
sv: AnvÃ¤nda citattecken istÃ¤llet fÃ¶r backticks.

source: Mismatched substitutions or footnote references.
sv: Felaktiga ersÃ¤ttningar eller fotnotreferenser.

source: The decorative Kashida letters should not be used in translation. These are also known as Tatweel.
sv: De dekorativa Kashida-bokstÃ¤verna bÃ¶r inte anvÃ¤ndas i Ã¶versÃ¤ttningar. Dessa kallas Ã¤ven Tatweel.

source: `Kashida on Wikipedia <https://en.wikipedia.org/wiki/Kashida>`_
sv: `Kashida pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Kashida>`_

source: `Markdown links <https://spec.commonmark.org/0.31.2/#links>`_
sv: `Markdown-lÃ¤nkar <https://spec.commonmark.org/0.31.2/#links>`_

source: Markdown syntax does not match source
sv: Markdown-syntax stÃ¤mmer inte Ã¶verens med kÃ¤llan

source: `Markdown inlines <https://spec.commonmark.org/0.31.2/#inlines>`_
sv: `Markdown-inline-taggar <https://spec.commonmark.org/0.31.2/#inlines>`_

source: Checks that translations are of acceptable length to fit available space. This only checks for the length of translation characters.
sv: Kontrollerar att Ã¶versÃ¤ttningarna har en acceptabel lÃ¤ngd fÃ¶r att passa det tillgÃ¤ngliga utrymmet. Detta kontrollerar endast lÃ¤ngden pÃ¥ Ã¶versÃ¤ttningens tecken.

source: Unlike the other checks, the flag should be set as a ``key:value`` pair like ``max-length:100``.
sv: Till skillnad frÃ¥n de andra kontrollerna ska flaggan anges som ett ``nyckel:vÃ¤rde``-par, till exempel ``max-length:100``.

source: This check looks at number of chars, what might not be the best metric when using proportional fonts to render the text. The :ref:`check-max-size` check does check actual rendering of the text.
sv: Denna kontroll tittar pÃ¥ antalet tecken, vilket kanske inte Ã¤r den bÃ¤sta mÃ¥ttstocken nÃ¤r man anvÃ¤nder proportionella teckensnitt fÃ¶r att Ã¥terge texten. Kontrollen :ref:`check-max-size` kontrollerar den faktiska Ã¥tergivningen av texten.

source: The ``replacements:`` flag might be also useful to expand placeables before checking the string.
sv: Flaggan ``replacements:`` kan ocksÃ¥ vara anvÃ¤ndbar fÃ¶r att expandera placerbara objekt innan strÃ¤ngen kontrolleras.

source: When ``xml-text`` flag is also used, the length calculation ignores XML tags.
sv: NÃ¤r flaggan ``xml-text`` ocksÃ¥ anvÃ¤nds ignoreras XML-taggar vid lÃ¤ngdberÃ¤kningen.

source: Translation rendered text should not exceed given size. It renders the text with line wrapping and checks if it fits into given boundaries.
sv: ÃversÃ¤ttningen fÃ¥r inte Ã¶verskrida angiven storlek. Den renderar texten med radbrytning och kontrollerar om den passar inom angivna grÃ¤nser.

source: This check needs one or two parameters - maximal width and maximal number of lines. In case the number of lines is not provided, one line text is considered.
sv: Denna kontroll krÃ¤ver en eller tvÃ¥ parametrar â maximal bredd och maximalt antal rader. Om antalet rader inte anges, antas texten bestÃ¥ av en rad.

source: You can also configure used font by ``font-*`` directives (see :ref:`custom-checks`), for example following translation flags say that the text rendered with ubuntu font size 22 should fit into two lines and 500 pixels:
sv: Du kan ocksÃ¥ konfigurera anvÃ¤nda teckensnitt med ``font-*``-direktiv (se :ref:`custom-checks`). Till exempel anger fÃ¶ljande Ã¶versÃ¤ttningsflaggor att texten som renderas med ubuntu-teckensnitt storlek 22 ska passa in pÃ¥ tvÃ¥ rader och 500 pixlar:

source: You might want to set ``font-*`` directives in :ref:`component` to have the same font configured for all strings within a component. You can override those values per string in case you need to customize it per string.
sv: Du kanske vill stÃ¤lla in ``font-*``-direktiv i :ref:`component` sÃ¥ att samma teckensnitt konfigureras fÃ¶r alla strÃ¤ngar inom en komponent. Du kan Ã¥sidosÃ¤tta dessa vÃ¤rden per strÃ¤ng om du behÃ¶ver anpassa dem per strÃ¤ng.

source: Mismatched \\n
sv: Felaktig matchning \\n

source: Number of \\n literals in translation does not match source.
sv: Antalet \\n-literaler i Ã¶versÃ¤ttningen stÃ¤mmer inte Ã¶verens med kÃ¤lltexten.

source: Usually escaped newlines are important for formatting program output. Check fails if the number of ``\n`` literals in translation does not match the source.
sv: Vanligtvis Ã¤r undantagna radbrytningar viktiga fÃ¶r formateringen av programmets utdata. Kontrollen misslyckas om antalet ``\n``-tecken i Ã¶versÃ¤ttningen inte stÃ¤mmer Ã¶verens med kÃ¤lltexten.

source: Checks that colons are replicated between both source and translation. The presence of colons is also checked for various languages where they do not belong (Chinese or Japanese).
sv: Kontrollerar att kolon replikeras mellan bÃ¥de kÃ¤llan och Ã¶versÃ¤ttningen. FÃ¶rekomsten av kolon kontrolleras ocksÃ¥ fÃ¶r olika sprÃ¥k dÃ¤r de inte hÃ¶r hemma (kinesiska eller japanska).

source: `Colon on Wikipedia <https://en.wikipedia.org/wiki/Colon_(punctuation)>`_
sv: `Kolon pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Colon_(punctuation)>`_

source: Checks that trailing ellipses are replicated between both source and translation. This only checks for real ellipsis (``â¦``) not for three dots (``...``).
sv: Kontrollerar att ellipser i slutet av meningar Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen. Detta kontrollerar endast riktiga ellipser (``â¦``) och inte tre punkter (``...``).

source: An ellipsis is usually rendered nicer than three dots in print, and sounds better with text-to-speech.
sv: En ellipsis ser oftast bÃ¤ttre ut Ã¤n tre punkter i tryck och lÃ¥ter bÃ¤ttre med text-till-tal.

source: `Ellipsis on Wikipedia <https://en.wikipedia.org/wiki/Ellipsis>`_
sv: `Ellipsis pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Ellipsis>`_

source: Checks that exclamations are replicated between both source and translation. The presence of exclamation marks is also checked for various languages where they do not belong (Chinese, Japanese, Korean, Armenian, Limbu, Myanmar or Nko).
sv: Kontrollerar att utropstecken Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen. FÃ¶rekomsten av utropstecken kontrolleras ocksÃ¥ fÃ¶r olika sprÃ¥k dÃ¤r de inte hÃ¶r hemma (kinesiska, japanska, koreanska, armeniska, limbu, burmesiska eller nko).

source: `Exclamation mark on Wikipedia <https://en.wikipedia.org/wiki/Exclamation_mark>`_
sv: `Utropstecken pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Exclamation_mark>`_

source: Checks that full stops are replicated between both source and translation. The presence of full stops is checked for various languages where they do not belong (Chinese, Japanese, Devanagari or Urdu).
sv: Kontrollerar att punkttecken Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen. FÃ¶rekomsten av punkttecken kontrolleras fÃ¶r olika sprÃ¥k dÃ¤r de inte hÃ¶r hemma (kinesiska, japanska, devanagari eller urdu).

source: `Full stop on Wikipedia <https://en.wikipedia.org/wiki/Full_stop>`_
sv: `Punkt pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Full_stop>`_

source: Checks that interrobang marks are replicated between both source and translation. It allows the swap between "!?" and "?!".
sv: Kontrollerar att interrobang-tecken Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen. Det gÃ¥r att vÃ¤xla mellan "!?" och "?!".

source: `Interrobang mark on Wikipedia <https://en.wikipedia.org/wiki/Interrobang>`_
sv: `Interrobang-tecken pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Interrobang>`_

source: Checks that question marks are replicated between both source and translation. The presence of question marks is also checked for various languages where they do not belong (Armenian, Arabic, Chinese, Korean, Japanese, Ethiopic, Vai or Coptic).
sv: Kontrollerar att frÃ¥getecken Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen. FÃ¶rekomsten av frÃ¥getecken kontrolleras Ã¤ven fÃ¶r olika sprÃ¥k dÃ¤r de inte hÃ¶r hemma (armeniska, arabiska, kinesiska, koreanska, japanska, etiopiska, vai eller koptiska).

source: `Question mark on Wikipedia <https://en.wikipedia.org/wiki/Question_mark>`_
sv: `FrÃ¥getecken pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Question_mark>`_

source: Checks that semicolons at the end of sentences are replicated between both source and translation.
sv: Kontrollerar att semikolon i slutet av meningar Ã¥terges bÃ¥de i kÃ¤lltexten och Ã¶versÃ¤ttningen.

source: `Semicolon on Wikipedia <https://en.wikipedia.org/wiki/Semicolon>`_
sv: `Semikolon pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Semicolon>`_

source: Usually newlines are important for formatting program output. Check fails if the number of new lines in translation does not match the source.
sv: Vanligtvis Ã¤r radbrytningar viktiga fÃ¶r formateringen av programmets utdata. Kontrollen misslyckas om antalet radbrytningar i Ã¶versÃ¤ttningen inte stÃ¤mmer Ã¶verens med kÃ¤lltexten.

source: Checks that all plural forms of a source string have been translated. Specifics on how each plural form is used can be found in the string definition.
sv: Kontrollerar att alla pluralformer av en kÃ¤llstrÃ¤ng har Ã¶versatts. Detaljer om hur varje pluralform anvÃ¤nds finns i strÃ¤ngdefinitionen.

source: Failing to fill in plural forms will in some cases lead to displaying nothing when the plural form is in use.
sv: Om pluralformer inte fylls i kommer det i vissa fall att leda till att ingenting visas nÃ¤r pluralformen anvÃ¤nds.

source: Checks that Kabyle translations use correct Kabyle letters and not similar Greek ones, which were often used before Kabyle characters were standardized in Unicode.
sv: Kontrollerar att kabyliska Ã¶versÃ¤ttningar anvÃ¤nder korrekta kabyliska bokstÃ¤ver och inte liknande grekiska bokstÃ¤ver, som ofta anvÃ¤ndes innan kabyliska tecken standardiserades i Unicode.

source: You can use regular expression as placeholder.
sv: Du kan anvÃ¤nda reguljÃ¤ra uttryck som platshÃ¥llare.

source: With the ``case-insensitive`` flag, the placeholders are not case-sensitive.
sv: Med flaggan ``case-insensitive`` Ã¤r platshÃ¥llarna inte skiftlÃ¤geskÃ¤nsliga.

source: Translation is missing some placeholders. These are either extracted from the translation file or defined manually using ``placeholders`` flag, more can be separated with colon, strings with space can be quoted:
sv: ÃversÃ¤ttningen saknar nÃ¥gra platshÃ¥llare. Dessa extraheras antingen frÃ¥n Ã¶versÃ¤ttningsfilen eller definieras manuellt med flaggan ``placeholders``. Flera kan separeras med kolon, strÃ¤ngar med mellanslag kan anges inom citationstecken:

source: In case you have some syntax for placeholders, you can use a regular expression:
sv: Om du har nÃ¥gon syntax fÃ¶r platshÃ¥llare kan du anvÃ¤nda ett reguljÃ¤rt uttryck:

source: You can also have case insensitive placeholders:
sv: Du kan ocksÃ¥ ha platshÃ¥llare som inte Ã¤r skiftlÃ¤geskÃ¤nsliga:

source: glossary strings
sv: ordlista strÃ¤ngar

source: The glossary is often shared as CSV and using some characters at the beginning is restricted by many applications as these can cause the text being evaluated as an expression. This also affects :ref:`glossary-mt` where many services use CSV for synchronizing glossaries and reject such strings.
sv: Ordlistan delas ofta som CSV-fil, och anvÃ¤ndningen av vissa tecken i bÃ¶rjan Ã¤r begrÃ¤nsad i mÃ¥nga applikationer, eftersom dessa kan leda till att texten tolkas som ett uttryck. Detta pÃ¥verkar Ã¤ven :ref:`glossary-mt`, dÃ¤r mÃ¥nga tjÃ¤nster anvÃ¤nder CSV fÃ¶r att synkronisera ordlistor och avvisar sÃ¥dana strÃ¤ngar.

source: This check used to apply to Breton language as well, but it was limited to French only.
sv: Denna kontroll gÃ¤llde tidigare Ã¤ven bretonska sprÃ¥ket, men begrÃ¤nsades till franska.

source: Checks that there is non breakable space before double punctuation sign (exclamation mark, question mark, semicolon and colon). This rule is used only in a few selected languages like French, where space before double punctuation sign is a typographic rule.
sv: Kontrollerar att det finns ett icke-brytbart mellanslag fÃ¶re dubbla skiljetecken (utropstecken, frÃ¥getecken, semikolon och kolon). Denna regel anvÃ¤nds endast i nÃ¥gra utvalda sprÃ¥k, sÃ¥som franska, dÃ¤r mellanslag fÃ¶re dubbla skiljetecken Ã¤r en typografisk regel.

source: `French and English spacing on Wikipedia <https://en.wikipedia.org/wiki/History_of_sentence_spacing#French_and_English_spacing>`_
sv: `Franska och engelska avstÃ¥nd pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/History_of_sentence_spacing#French_and_English_spacing>`_

source: Extended support for advanced regular expressions including Unicode codepoint properties.
sv: UtÃ¶kat stÃ¶d fÃ¶r avancerade reguljÃ¤ra uttryck, inklusive Unicode-kodpunktsegenskaper.

source: Translation does not match regular expression. The expression is either extracted from the translation file or defined manually using ``regex`` flag:
sv: ÃversÃ¤ttningen stÃ¤mmer inte Ã¶verens med det reguljÃ¤ra uttrycket. Uttrycket extraheras antingen frÃ¥n Ã¶versÃ¤ttningsfilen eller definieras manuellt med hjÃ¤lp av flaggan ``regex``:

source: The matching also supports Unicode codepoint properties, including scripts and blocks:
sv: Matchningen stÃ¶der Ã¤ven Unicode-kodpunktsegenskaper, inklusive skript och block:

source: `regex documentation <https://github.com/mrabarnett/mrab-regex>`_
sv: `regex-dokumentation <https://github.com/mrabarnett/mrab-regex>`_

source: reStructuredText syntax error in the translation. Issues to look for:
sv: reStructuredText-syntaxfel i Ã¶versÃ¤ttningen. Problem att leta efter:

source: Mismatched closing/opening tags.
sv: Felaktigt matchade stÃ¤ngnings-/Ã¶ppningstaggar.

source: Check that fails if the same translation is used on different source strings. Such translations can be intentional, but can also confuse users.
sv: Kontrollera att samma Ã¶versÃ¤ttning inte anvÃ¤nds fÃ¶r olika kÃ¤llstrÃ¤ngar. SÃ¥dana Ã¶versÃ¤ttningar kan vara avsiktliga, men kan ocksÃ¥ fÃ¶rvirra anvÃ¤ndarna.

source: Check that fails if some plural forms are duplicated in the translation. In most languages they have to be different.
sv: Kontrollera att det inte finns nÃ¥gra pluralformer som fÃ¶rekommer dubbelt i Ã¶versÃ¤ttningen. I de flesta sprÃ¥k mÃ¥ste de vara olika.

source: Newlines usually appear in source strings for good reason, omissions or additions can lead to formatting problems when the translated text is put to use.
sv: Nya rader fÃ¶rekommer vanligtvis i kÃ¤llstrÃ¤ngar av goda skÃ¤l, eftersom utelÃ¤mnanden eller tillÃ¤gg kan leda till formateringsproblem nÃ¤r den Ã¶versatta texten anvÃ¤nds.

source: A space in the beginning of a string is usually used for indentation in the interface and thus important to keep.
sv: Ett mellanslag i bÃ¶rjan av en strÃ¤ng anvÃ¤nds vanligtvis fÃ¶r indrag i grÃ¤nssnittet och Ã¤r dÃ¤rfÃ¶r viktigt att behÃ¥lla.

source: Checks that trailing spaces are replicated between both source and translation.
sv: Kontrollerar att efterfÃ¶ljande mellanslag replikeras mellan bÃ¥de kÃ¤llan och Ã¶versÃ¤ttningen.

source: Trailing space is usually utilized to space out neighbouring elements, so removing it might break layout.
sv: EfterfÃ¶ljande mellanslag anvÃ¤nds vanligtvis fÃ¶r att skapa avstÃ¥nd mellan nÃ¤rliggande element, sÃ¥ att ta bort det kan fÃ¶rstÃ¶ra layouten.

source: Happens if the source and corresponding translation strings are identical, down to at least one of the plural forms. Some strings commonly found across all languages are ignored, and various markups are stripped. This reduces the number of false positives.
sv: HÃ¤nder om kÃ¤lltexten och motsvarande Ã¶versÃ¤ttningsstrÃ¤ngar Ã¤r identiska, Ã¥tminstone nÃ¤r det gÃ¤ller en av pluralformerna. Vissa strÃ¤ngar som fÃ¶rekommer i alla sprÃ¥k ignoreras, och olika markeringar tas bort. Detta minskar antalet falska positiva resultat.

source: This check can help find strings mistakenly untranslated.
sv: Denna kontroll kan hjÃ¤lpa till att hitta strÃ¤ngar som av misstag inte har Ã¶versatts.

source: The default behavior of this check is to exclude words from the built-in terms list from the checking. These are words which are frequently not being translated. This is useful to avoid false positives on short strings, which consist only of a single word which is the same in several languages. This list can be disabled by adding ``strict-same`` flag to a string or component.
sv: StandardinstÃ¤llningen fÃ¶r denna kontroll Ã¤r att utesluta ord frÃ¥n den inbyggda termlistan frÃ¥n kontrollen. Det Ã¤r ord som ofta inte Ã¶versÃ¤tts. Detta Ã¤r anvÃ¤ndbart fÃ¶r att undvika falska positiva resultat pÃ¥ korta strÃ¤ngar, som endast bestÃ¥r av ett enda ord som Ã¤r detsamma pÃ¥ flera sprÃ¥k. Denna lista kan inaktiveras genom att lÃ¤gga till flaggan ``strict-same`` till en strÃ¤ng eller komponent.

source: With ``check-glossary`` flag (see :ref:`check-check-glossary`), the untranslatable glossary terms are excluded from the checking.
sv: Med flaggan ``check-glossary`` (se :ref:`check-check-glossary`) utesluts de icke Ã¶versÃ¤ttningsbara termerna i ordlistan frÃ¥n kontrollen.

source: The translation uses unsafe HTML markup. This check has to be enabled using ``safe-html`` flag (see :ref:`custom-checks`). There is also accompanied autofixer which can automatically sanitize the markup.
sv: ÃversÃ¤ttningen anvÃ¤nder osÃ¤ker HTML-markering. Denna kontroll mÃ¥ste aktiveras med flaggan ``safe-html`` (se :ref:`custom-checks`). Det finns ocksÃ¥ en medfÃ¶ljande autofixer som automatiskt kan rensa markeringen.

source: When ``md-text`` flag is also used, the Markdown style links are also allowed.
sv: NÃ¤r flaggan ``md-text`` ocksÃ¥ anvÃ¤nds Ã¤r lÃ¤nkar i Markdown-stil ocksÃ¥ tillÃ¥tna.

source: The HTML check is performed by the `Ammonia <https://github.com/rust-ammonia/ammonia>`_ library.
sv: HTML-kontrollen utfÃ¶rs av biblioteket `Ammonia <https://github.com/rust-ammonia/ammonia>`_.

source: The translation does not contain an URL. This is triggered only in case the unit is marked as containing URL. In that case the translation has to be a valid URL.
sv: ÃversÃ¤ttningen innehÃ¥ller ingen URL. Detta utlÃ¶ses endast om enheten Ã¤r markerad som innehÃ¥llande URL. I sÃ¥ fall mÃ¥ste Ã¶versÃ¤ttningen vara en giltig URL.

source: This usually means the resulting output will look different. In most cases this is not a desired result from changing the translation, but occasionally it is.
sv: Detta innebÃ¤r vanligtvis att det slutliga resultatet kommer att se annorlunda ut. I de flesta fall Ã¤r detta inte ett Ã¶nskat resultat av att Ã¶versÃ¤ttningen Ã¤ndras, men ibland Ã¤r det det.

source: Checks that XML tags are replicated between both source and translation.
sv: Kontrollerar att XML-taggar replikeras mellan bÃ¥de kÃ¤llan och Ã¶versÃ¤ttningen.

source: The check is automatically enabled for XML like strings. You might need to add ``xml-text`` flag in some cases to force turning it on.
sv: Kontrollen aktiveras automatiskt fÃ¶r XML-liknande strÃ¤ngar. I vissa fall kan du behÃ¶va lÃ¤gga till flaggan ``xml-text`` fÃ¶r att tvinga fram aktiveringen.

source: This check is disabled by the ``safe-html`` flag as the HTML cleanup done by it can produce HTML markup which is not valid XML.
sv: Denna kontroll inaktiveras av flaggan ``safe-html`` eftersom HTML-rensningen som utfÃ¶rs av den kan generera HTML-markeringar som inte Ã¤r giltiga XML.

source: The XML markup is not valid.
sv: XML-markeringen Ã¤r inte giltig.

source: Zero-width space (<U+200B>) characters are used to break messages within words (word wrapping).
sv: Tecken med nollbredd (<U+200B>) anvÃ¤nds fÃ¶r att dela upp meddelanden inom ord (ordbrytning).

source: As they are usually inserted by mistake, this check is triggered once they are present in translation. Some programs might have problems when this character is used.
sv: Eftersom de vanligtvis infogas av misstag, utlÃ¶ses denna kontroll nÃ¤r de fÃ¶rekommer i Ã¶versÃ¤ttningen. Vissa program kan ha problem nÃ¤r detta tecken anvÃ¤nds.

source: `Zero width space on Wikipedia <https://en.wikipedia.org/wiki/Zero-width_space>`_
sv: `Nollbreddsmellanslag pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Zero-width_space>`_

source: Source checks
sv: KÃ¤llkontroller

source: Source checks can help developers improve the quality of source strings.
sv: KÃ¤llkontroller kan hjÃ¤lpa utvecklare att fÃ¶rbÃ¤ttra kvaliteten pÃ¥ kÃ¤llstrÃ¤ngar.

source: The string uses three dots (``...``) instead of an ellipsis character (``â¦``).
sv: StrÃ¤ngen anvÃ¤nder tre punkter (``...``) istÃ¤llet fÃ¶r ett ellipsstecken (``â¦``).

source: source strings
sv: kÃ¤llstrÃ¤ngar

source: This fails when the string uses three dots (``...``) when it should use an ellipsis character (``â¦``).
sv: Detta misslyckas nÃ¤r strÃ¤ngen anvÃ¤nder tre punkter (``...``) nÃ¤r den borde anvÃ¤nda ett ellipsistecken (``â¦``).

source: Using the Unicode character is in most cases the better approach and looks better rendered, and may sound better with text-to-speech.
sv: Att anvÃ¤nda Unicode-tecknet Ã¤r i de flesta fall det bÃ¤sta alternativet, eftersom det ser bÃ¤ttre ut och kan lÃ¥ta bÃ¤ttre med text-till-tal-funktioner.
